================================================================================
Double quoted string in command
================================================================================

api: echo "hello world"

--------------------------------------------------------------------------------

(source_file
  (process_definition
    (declaration
      (process_name))
    (execution
      (command))))

================================================================================
Single quoted option value
================================================================================

api dir='./my dir': go run ./cmd/api

--------------------------------------------------------------------------------

(source_file
  (process_definition
    (declaration
      (process_name)
      (option
        (option_key)
        (option_value
          (single_quoted_string))))
    (execution
      (command))))

================================================================================
Double quoted option value
================================================================================

api dir="./my dir": go run ./cmd/api

--------------------------------------------------------------------------------

(source_file
  (process_definition
    (declaration
      (process_name)
      (option
        (option_key)
        (option_value
          (double_quoted_string))))
    (execution
      (command))))

================================================================================
Quoted pattern
================================================================================

api "src/**/*.go": go run ./cmd/api

--------------------------------------------------------------------------------

(source_file
  (process_definition
    (declaration
      (process_name)
      (glob_pattern
        (double_quoted_string)))
    (execution
      (command))))

================================================================================
Quoted option value with spaces
================================================================================

server after="echo hello": start

--------------------------------------------------------------------------------

(source_file
  (process_definition
    (declaration
      (process_name)
      (option
        (option_key)
        (option_value
          (double_quoted_string))))
    (execution
      (command))))

================================================================================
Multiple options with quoted values
================================================================================

server after="db init" dir="./my app": start

--------------------------------------------------------------------------------

(source_file
  (process_definition
    (declaration
      (process_name)
      (option
        (option_key)
        (option_value
          (double_quoted_string)))
      (option
        (option_key)
        (option_value
          (double_quoted_string))))
    (execution
      (command))))

================================================================================
Mixed quoted and unquoted option values
================================================================================

server after="echo hello" dir=src ready=http:8080: start

--------------------------------------------------------------------------------

(source_file
  (process_definition
    (declaration
      (process_name)
      (option
        (option_key)
        (option_value
          (double_quoted_string)))
      (option
        (option_key)
        (option_value))
      (option
        (option_key)
        (option_value)))
    (execution
      (command))))

================================================================================
Quoted glob pattern in exclusion
================================================================================

api !"test/**/*.go": go run ./cmd/api

--------------------------------------------------------------------------------

(source_file
  (process_definition
    (declaration
      (process_name)
      (exclusion_pattern
        (double_quoted_string)))
    (execution
      (command))))
